external-data-processor-excel-scripts/ssl/Documents/Производство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Производство</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цехи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяИзготовления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

external-data-processor-excel-scripts/ssl/Documents/Производство/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)     
	
	НаборЗаписей = РегистрыСведений.ВремяИзготовленияПродукции.СоздатьНаборЗаписей();   
	НаборЗаписей.Отбор.Продукция.Установить(Продукт);
	НаборЗаписей.Отбор.Цех.Установить(Цех);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		// Если записей нет, добавляем новую запись
		Запись = НаборЗаписей.Добавить();        
		Запись.Продукция = Продукт;
		Запись.Цех = Цех;
		Запись.Время = ВремяИзготовления;  
	КонецЕсли;
	НаборЗаписей.Записать();   
	
КонецПроцедуры
